# Pandas

## create a pandas series

In [1]:
import pandas as pd

In [2]:
pd.Series([10,21,33,76,99])

0    10
1    21
2    33
3    76
4    99
dtype: int64

In [5]:
seri = pd.Series([12,4,55,15,26])
type(seri)

pandas.core.series.Series

In [7]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [9]:
seri.dtype

dtype('int64')

In [10]:
seri.size

5

In [11]:
seri.ndim

1

In [14]:
seri.values

array([12,  4, 55, 15, 26], dtype=int64)

In [15]:
seri.head(3)

0    12
1     4
2    55
dtype: int64

In [16]:
seri.tail(3)

2    55
3    15
4    26
dtype: int64

In [17]:
# index isimlendirmesi

In [18]:
pd.Series([44,23,36,7,89])

0    44
1    23
2    36
3     7
4    89
dtype: int64

In [20]:
pd.Series([44,23,36,7,89], index=[1,3,5,7,9])

1    44
3    23
5    36
7     7
9    89
dtype: int64

In [23]:
seri = pd.Series([44,23,36,7,89], index=["a","b","c","d","e"])
seri

a    44
b    23
c    36
d     7
e    89
dtype: int64

In [24]:
seri["a"]

44

In [25]:
# sozluk uzerinden liste olusturmak

In [26]:
sozluk = {"reg" : 10, "log" : 11, "cart" : 12}

In [27]:
seri = pd.Series(sozluk)

In [28]:
seri

reg     10
log     11
cart    12
dtype: int64

In [29]:
# iki seriyi  birlestirerek seri olusturma

In [30]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

## Create Pandas DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
l = [12,23,7,43,67,32]
l

[12, 23, 7, 43, 67, 32]

In [4]:
pd.DataFrame(l, columns=["degisken_ismi"])

   degisken_ismi
0             12
1             23
2              7
3             43
4             67
5             32

In [6]:
m = np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [9]:
pd.DataFrame(m, columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [10]:
# dataframe isimlendirme

In [11]:
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df.columns = ("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [12]:
df.head(2)

   deg1  deg2  deg3
0     1     2     3
1     4     5     6

In [13]:
df.tail(2)

   deg1  deg2  deg3
1     4     5     6
2     7     8     9

## Elements operations

In [14]:
import numpy as np
import pandas as pd

In [15]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [16]:
sozluk = {"var1" : s1, "var2" : s2, "var3" : s3}
sozluk

{'var1': array([5, 0, 9, 3, 9]),
 'var2': array([2, 4, 7, 1, 0]),
 'var3': array([0, 3, 0, 4, 4])}

In [17]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     5     2     0
1     0     4     3
2     9     7     0
3     3     1     4
4     9     0     4

In [18]:
df.index = ("a","b","c","d","e")
df

   var1  var2  var3
a     5     2     0
b     0     4     3
c     9     7     0
d     3     1     4
e     9     0     4

In [19]:
# delete

In [26]:
df.drop("a", axis=0)

   var1  var2  var3
b     0     4     3
c     9     7     0
d     3     1     4
e     9     0     4

In [24]:
df

   var1  var2  var3
a     5     2     0
b     0     4     3
c     9     7     0
d     3     1     4
e     9     0     4

In [27]:
df.drop("a", axis=0, inplace= True)

In [28]:
df

   var1  var2  var3
b     0     4     3
c     9     7     0
d     3     1     4
e     9     0     4

In [29]:
df.drop("var3", axis=1)

   var1  var2
b     0     4
c     9     7
d     3     1
e     9     0

## conditional element operations

In [30]:
import numpy as np
import pandas as pd

In [31]:
m = np.random.randint(1,30, (10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0    23    17    22
1     3    15    26
2     1    12    15
3    26    26    20
4    29    27     7
5    14     9    24
6    19    20    23
7    20     7     6
8    20    10    26
9    21     7     4

In [32]:
df["var1"]

0    23
1     3
2     1
3    26
4    29
5    14
6    19
7    20
8    20
9    21
Name: var1, dtype: int32

In [34]:
df.loc[0:2]

   var1  var2  var3
0    23    17    22
1     3    15    26
2     1    12    15

In [35]:
df.iloc[0:2]

   var1  var2  var3
0    23    17    22
1     3    15    26

In [38]:
df[0:2][["var1","var2"]]

   var1  var2
0    23    17
1     3    15

In [39]:
df

   var1  var2  var3
0    23    17    22
1     3    15    26
2     1    12    15
3    26    26    20
4    29    27     7
5    14     9    24
6    19    20    23
7    20     7     6
8    20    10    26
9    21     7     4

In [44]:
df[df.var1 > 20][["var1","var2"]]

   var1  var2
0    23    17
3    26    26
4    29    27
9    21     7

## Join operating

In [54]:
m = np.random.randint(1,30, (5,3))
df1 = pd.DataFrame(m, columns=["var1","var2","var3"])
df1

   var1  var2  var3
0    22     7    21
1    15     9     3
2    13    15    23
3    27     9    29
4    14    20    12

In [55]:
df2 = df1 + 99
df2

   var1  var2  var3
0   121   106   120
1   114   108   102
2   112   114   122
3   126   108   128
4   113   119   111

In [60]:
?pd.concat

In [49]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3
0    23    14    18
1    13    24     4
2    14     3    15
3     7    12     1
4     2     9    18
5   122   113   117
6   112   123   103
7   113   102   114
8   106   111   100
9   101   108   117

In [58]:
df2.columns = ["var1","var2","deg3"]
df2

   var1  var2  deg3
0   121   106   120
1   114   108   102
2   112   114   122
3   126   108   128
4   113   119   111

In [61]:
pd.concat([df1,df2], join="inner")

   var1  var2
0    22     7
1    15     9
2    13    15
3    27     9
4    14    20
0   121   106
1   114   108
2   112   114
3   126   108
4   113   119

## advanced join operations

In [63]:
df1 = pd.DataFrame({"calisanlar" : ["Ali","Veli","Ayse","Fatma"],
                   "grup" : ["Muhasebe","Muhendislik","Muhendislik","IK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [64]:
df2 = pd.DataFrame({"calisanlar" : ["Ayse","Ali","Veli","Fatma"],
                   "ilk_giris" : [2009,2010,2014,2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2009
1        Ali       2010
2       Veli       2014
3      Fatma       2019

In [67]:
pd.merge(df1,df2, on="calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2009
3      Fatma           IK       2019

In [68]:
# coktan teke, (many to one)

In [69]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2009
3      Fatma           IK       2019

In [71]:
df4 = pd.DataFrame({"grup" : ["Muhasebe","Muhendislik","IK"],
                   "mudur" : ["Caner","Mustafa","Berkcan"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [75]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2009  Mustafa
3      Fatma           IK       2019  Berkcan

In [76]:
# coktan coka, (many to many)

In [77]:
df5 = pd.DataFrame({"grup" : ["Muhasebe","Muhendislik","Muhendislik","Muhendislik","IK","IK"],
                   "yetenekler" : ["matematik","excel","kodlama","linux","excel","yonetim"]})
df5

          grup yetenekler
0     Muhasebe  matematik
1  Muhendislik      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [78]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [79]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1       Veli  Muhendislik      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik      excel
5       Ayse  Muhendislik    kodlama
6       Ayse  Muhendislik      linux
7      Fatma           IK      excel
8      Fatma           IK    yonetim

# Aggregation & Grouping

* **count()**
* **first()**
* **last()**
* **mean()**
* **median()**
* **min()**
* **max()**
* **std()**
* **var()**
* **sum()**

In [80]:
import seaborn as sns

In [82]:
?sns.load_dataset

In [83]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [84]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [86]:
df.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [88]:
df.shape

(1035, 6)

In [93]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [95]:
df["mass"].mean()

2.6381605847953233

In [97]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

## grouping operations

In [11]:
import pandas as pd
import numpy as np
import seaborn as sns

In [5]:
sozluk = {"gruplar" : ["A","B","C","A","B","C"],
         "veri" : [10,11,52,23,43,55]}
sozluk

{'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'], 'veri': [10, 11, 52, 23, 43, 55]}

In [6]:
df = pd.DataFrame(sozluk, columns=["gruplar","veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [7]:
df.groupby("gruplar")

In [8]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [9]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [10]:
df.groupby("gruplar").std()

              veri
gruplar
A         9.192388
B        22.627417
C         2.121320

In [12]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [13]:
df.groupby("method")

In [14]:
df.groupby("method").mean()

,number,orbital_period,mass,distance,year
method,,,,,
Astrometry,1.000000,631.180000,NaN,17.875000,2011.500000
Eclipse Timing Variations,1.666667,4751.644444,5.125000,315.360000,2010.000000
Imaging,1.315789,118247.737500,NaN,67.715937,2009.131579
Microlensing,1.173913,3153.571429,NaN,4144.000000,2009.782609
Orbital Brightness Modulation,1.666667,0.709307,NaN,1180.000000,2011.666667
Pulsar Timing,2.200000,7343.021201,NaN,1200.000000,1998.400000
Pulsation Timing Variations,1.000000,1170.000000,NaN,NaN,2007.000000
Radial Velocity,1.721519,823.354680,2.630699,51.600208,2007.518987
Transit,1.954660,21.102073,1.470000,599.298080,2011.236776
Transit Timing Variations,2.250000,79.783500,NaN,1104.333333,2012.500000

In [16]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

## Aggregate

In [17]:
import pandas as pd
import numpy as np

In [18]:
sozluk = {"gruplar" : ["A","B","C","A","B","C"],
         "degisken1" : [10,23,33,22,11,99],
         "degisken2" : [100,253,333,262,111,969]}
sozluk

{'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
 'degisken1': [10, 23, 33, 22, 11, 99],
 'degisken2': [100, 253, 333, 262, 111, 969]}

In [21]:
df = pd.DataFrame(sozluk, columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [23]:
df.groupby("gruplar").aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [24]:
df.groupby("gruplar").aggregate([min,max])

        degisken1     degisken2
              min max       min  max
gruplar
A              10  22       100  262
B              11  23       111  253
C              33  99       333  969

In [25]:
df.groupby("gruplar").aggregate({"degisken1" : min, "degisken2" : max})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

## Filter

In [26]:
import pandas as pd
import numpy as np

In [27]:
sozluk = {"gruplar" : ["A","B","C","A","B","C"],
         "degisken1" : [10,23,33,22,11,99],
         "degisken2" : [100,253,333,262,111,969]}

df = pd.DataFrame(sozluk, columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [28]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [29]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [30]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

## Transform

In [31]:
import pandas as pd
import numpy as np

In [32]:
sozluk = {"gruplar" : ["A","B","C","A","B","C"],
         "degisken1" : [10,23,33,22,11,99],
         "degisken2" : [100,253,333,262,111,969]}

df = pd.DataFrame(sozluk, columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [43]:
df_a = df.iloc[:,1:3]
df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [45]:
df_a.transform(lambda x : ((x-x.mean()) / x.std()))

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

## Apply

In [47]:
import numpy as np
import pandas as pd

In [51]:
sozluk = {
         "degisken1" : [10,23,33,22,11,99],
         "degisken2" : [100,253,333,262,111,969]}

df = pd.DataFrame(sozluk, columns=["degisken1","degisken2"])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [52]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [53]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

## Pivot Tables

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [7]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [9]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [10]:
# pivot ile table

In [13]:
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# Dis Kaynakli Veri Okuma

In [2]:
import pandas as pd

In [12]:
# csv okuma
pd.read_csv("reading_data/ornekcsv.csv", sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [13]:
# txt okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [14]:
# exxel okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0